esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3u/svd/SAM3U2C.svd
        <register>
          <name>ECC_PR3_W8BIT</name>
          <description>SMC ECC parity 3 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR4</name>
          <description>SMC ECC parity 4 Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR4_W8BIT</name>
          <description>SMC ECC parity 4 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR5</name>
          <description>SMC ECC parity 5 Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR5_W8BIT</name>
          <description>SMC ECC parity 5 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR6</name>
          <description>SMC ECC parity 6 Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR6_W8BIT</name>
          <description>SMC ECC parity 6 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR7</name>
          <description>SMC ECC parity 7 Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR7_W8BIT</name>
          <description>SMC ECC parity 7 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR8</name>
          <description>SMC ECC parity 8 Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR9</name>
          <description>SMC ECC parity 9 Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR10</name>
          <description>SMC ECC parity 10 Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR11</name>
          <description>SMC ECC parity 11 Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR12</name>
          <description>SMC ECC parity 12 Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR13</name>
          <description>SMC ECC parity 13 Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR14</name>
          <description>SMC ECC parity 14 Register</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR15</name>
          <description>SMC ECC parity 15 Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP0</name>
          <description>SMC Setup Register (CS_number = 0)</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_SETUP</name>
              <description>NWE Setup Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_SETUP</name>
              <description>NCS Setup Length in Write Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_SETUP</name>
              <description>NRD Setup Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_SETUP</name>
              <description>NCS Setup Length in Read Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSE0</name>
          <description>SMC Pulse Register (CS_number = 0)</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010101</resetValue>
          <fields>
            <field>
              <name>NWE_PULSE</name>
              <description>NWE Pulse Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_WR_PULSE</name>
              <description>NCS Pulse Length in WRITE Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRD_PULSE</name>
              <description>NRD Pulse Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCS_RD_PULSE</name>
              <description>NCS Pulse Length in READ Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
