esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3u/svd/SAM3U2C.svd
                  <name>ROMLESS</name>
                  <description>ROMless or on-chip Flash</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>Embedded Flash Memory</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROM_FLASH</name>
                  <description>ROM and Embedded Flash MemoryNVPSIZ is ROM size      NVPSIZ2 is Flash size</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>SRAM emulating ROM</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT</name>
              <description>Extension Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXID</name>
          <description>Chip ID Extension Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EXID</name>
              <description>Chip ID Extension</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EFC0</name>
      <version>6450E</version>
      <description>Embedded Flash Controller 0</description>
      <groupName>EFC</groupName>
      <prependToName>EFC0_</prependToName>
      <baseAddress>0x400E0800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ID_EFC0</name>
        <value>6</value>
      </interrupt>
      <registers>
        <register>
          <name>FMR</name>
          <description>EEFC Flash Mode Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWS</name>
              <description>Flash Wait State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCOD</name>
              <description>Sequential Code Optimization Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAM</name>
              <description>Flash Access Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>EEFC Flash Command Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FCMD</name>
              <description>Flash Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FARG</name>
              <description>Flash Command Argument</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FKEY</name>
              <description>Flash Writing Protection Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSR</name>
          <description>EEFC Flash Status Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCMDE</name>
              <description>Flash Command Error Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLOCKE</name>
              <description>Flash Lock Error Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRR</name>
          <description>EEFC Flash Result Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FVALUE</name>
              <description>Flash Result Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
